app/Http/Controllers/Auth/AuthenticatedSessionController.php

select * from `users` where `email` = 'hamza.ougayour@cybergenix.fr' limit 1
---
    public function store(LoginRequest $request)
    {
        $user = User::where('email',$request->email)->first();