Modules/LandingPage/Entities/LandingPageSetting.php

select * from `landing_page_settings`
---
    public static function fetchSettings()
    {
        $data = LandingPageSetting::get();