app/Http/Controllers/EmailTemplateController.php

    public function manageEmailLang($id, $lang = 'en')
    {
        if(\Auth::user()->type == 'super admin')
        {
            $languages         = Utility::languages();
            $emailTemplate     = EmailTemplate::getemailtemplate();
            $currEmailTempLang = EmailTemplateLang::where('parent_id', '=', $id)->where('lang', $lang)->first();
            if(empty($currEmailTempLang))
            {
                return redirect()->back()->with('error', __('Not exists in email template.'));
            }
            if(!isset($currEmailTempLang) || empty($currEmailTempLang))
            {
                $currEmailTempLang       = EmailTemplateLang::where('parent_id', '=', $id)->where('lang', 'en')->first();
                $currEmailTempLang->lang = $lang;
            }

            if(\Auth::user()->type == 'super admin')
			{
				$emailTemplate     = EmailTemplate::where('id', '=', $id)->first();
			}
			else {

				$settings         = Utility::settings();
				$emailTemplate     = $settings['owner_name'];
			}
            $EmailTemplates = EmailTemplate::all();
---
select * from `email_template_langs` where `parent_id` = '4' and `lang` = 'fr' limit 1
select * from `email_templates` where `id` = '4' limit 1
select * from `email_templates`