app/Http/Controllers/PlanController.php

    public function index()
    {
        if (\Auth::user()->type == 'super admin' || (\Auth::user()->type == 'owner')) {
            if(\Auth::user()->type == 'super admin'){
                $plans = Plan::all();
---
select * from `plans`

    public function edit($plan_id)
    {
        if (\Auth::user()->type == 'super admin') {
            $arrDuration = Plan::$arrDuration;
            $plan        = Plan::find($plan_id);
---
select * from `plans` where `plans`.`id` = '1' limit 1

    public function update(Request $request, $plan_id)
    {
        if (\Auth::user()->type == 'super admin') {
            $plan = Plan::find($plan_id);
            $payment = Utility::set_payment_settings();
            if (count($payment) > 0 || $request->price <= 0) {


                if (!empty($plan)) {
                    $validation                = [];
                    $validation['name']        = 'required|unique:plans,name,' . $plan_id;
                    $validation['duration']    = 'required';
                    $validation['max_user']    = 'required|numeric';
                    $validation['max_account'] = 'required|numeric';
                    $validation['max_contact'] = 'required|numeric';
                    $validation['storage_limit']  = 'required|numeric';
                    $validation['enable_chatgpt'] = 'required|string';

                    $post = $request->all();
                    $post['enable_chatgpt'] = ($request->enable_chatgpt == 'on') ? 'on' : 'off';

                    $post['trial'] = !empty($request->trial) ? $request->trial : 0;

                    if($request->trial == 1){

                        $post['trial_days'] = !empty($request->trial_days) ? $request->trial_days : 0;
                    }
                    if ($plan->update($post)) {
---
select * from `plans` where `plans`.`id` = '1' limit 1
update `plans` set `duration` = 'month', `plans`.`updated_at` = '2024-10-06 21:23:41' where `id` = 1