app/Http/Controllers/SettingController.php

    public function index()
    {
        if (\Auth::user()->type == 'owner' || \Auth::user()->type == 'super admin') {
            $settings = Utility::settings();

            $payment = Utility::set_payment_settings();
            $webhooks = Webhook::where('created_by', \Auth::user()->id)->get();
---
select * from `webhooks` where `created_by` = 1