app/Models/Utility.php

select * from `settings` where `created_by` = 1
---
    public static function fetchSettings()
    {
        $data = DB::table('settings');

        if (\Auth::check()) {
            $data = $data->where('created_by', '=', \Auth::user()->creatorId())->get();
            if (count($data) == 0) {
                $data = DB::table('settings')->where('created_by', '=', 1)->get();
            }
        } else {
            $data->where('created_by', '=', 1);
            $data = $data->get();

select * from `settings` where `created_by` = 1
---
    public static function settingsById($id)
    {

        $data     = DB::table('settings');
        $data     = $data->where('created_by', '=', $id);
        $data     = $data->get();

select * from `admin_payment_settings` where `created_by` = 1
---
    public static function payment_settings()
    {
        $data = DB::table('admin_payment_settings');
        if (Auth::check()) {
            $data->where('created_by', '=', Auth::user()->createId());
        } else {
            $data->where('created_by', '=', 1);
        }
        $data = $data->get();

select * from `admin_payment_settings` where `created_by` = 1
---
    public static function set_payment_settings()
    {
        $data = DB::table('admin_payment_settings');

        if (Auth::check()) {
            $data->where('created_by', '=', \Auth::user()->creatorId());
        } else {
            $data->where('created_by', '=', 1);
        }
        $data = $data->get();

select `fullname`, `code` from `languages`
---
    public static function fetchLanguages()
    {
        $languages = Utility::langList();
        if (\Schema::hasTable('languages')) {
            $settings = self::settings();
            if (!empty($settings['disable_lang'])) {
                $disabledlang = explode(',', $settings['disable_lang']);

                $languages = Languages::whereNotIn('code', $disabledlang)->pluck('fullname', 'code');
            } else {
                $languages = Languages::pluck('fullname', 'code');

select `value`, `name` from `settings` where `created_by` = 1
select * from `users` where `type` = 'super admin' limit 1
---
    public static function colorset()
    {
        if (\Auth::user()) {
            if (\Auth::user()->type == 'super admin') {
                $user = \Auth::user();
                $setting = DB::table('settings')->where('created_by', $user->id)->pluck('value', 'name')->toArray();
            } else {
                $setting = DB::table('settings')->where('created_by', \Auth::user()->creatorId())->pluck('value', 'name')->toArray();
            }
        } else {
            $user = User::where('type', 'super admin')->first();
            $setting = DB::table('settings')->where('created_by', $user->id)->pluck('value', 'name')->toArray();